[
    {
        "id": 1,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "coverImage": "https://m.media-amazon.com/images/I/91lslnZ-btL._SY466_.jpg",
        "review": "A gripping psychological thriller with a twist that leaves you speechless. Alicia Berenson, a famous painter, shoots her husband and then stops speaking. Theo Faber, a forensic psychotherapist, becomes obsessed with her case, determined to uncover the truth behind her silence. Michaelides crafts a suspenseful narrative filled with unexpected turns, psychological depth, and a jaw-dropping conclusion. The story's intricate layers and the unraveling of its mystery keep readers engaged and guessing until the very end. The novel's exploration of trauma, identity, and truth is both compelling and thought-provoking.",
        "pages": 336,
        "rating": 4.3,
        "category": "Thriller",
        "tag": "Suspense",
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "id": 2,
        "bookName": "Becoming",
        "author": "Michelle Obama",
        "coverImage": "https://m.media-amazon.com/images/I/81h2gWPTYJL.jpg",
        "review": "An inspiring and deeply personal memoir from the former First Lady. Michelle Obama's 'Becoming' offers a candid and heartfelt account of her journey from her childhood in the South Side of Chicago to her role as the First Lady of the United States. Through poignant reflections and honest storytelling, Obama shares the challenges and triumphs that shaped her, including her experiences with race, identity, and public service. Her eloquence and grace shine through, making this memoir not just a political account but a universal story of resilience and self-discovery.",
        "pages": 448,
        "rating": 4.9,
        "category": "Biography",
        "tag": "Inspiration",
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2018
    },
    {
        "id": 3,
        "bookName": "Where the Crawdads Sing",
        "author": "Delia Owens",
        "coverImage": "https://m.media-amazon.com/images/I/41nbMBlE-8L._SY445_SX342_.jpg",
        "review": "A haunting and beautiful story of a girl growing up in the wild marshes. Kya Clark, the 'Marsh Girl,' lives isolated in the swamps of North Carolina, and her story unfolds through alternating timelines of her childhood and a mysterious murder investigation. Delia Owens crafts a lyrical narrative rich with natural detail and emotional depth, exploring themes of loneliness, love, and survival. The novel's vivid descriptions and evocative prose draw readers into Kya’s world, making it a compelling read that intertwines mystery and a touching coming-of-age tale.",
        "pages": 384,
        "rating": 4.6,
        "category": "Fiction",
        "tag": "Mystery",
        "publisher": "G.P. Putnam's Sons",
        "yearOfPublishing": 2018
    },
    {
        "id": 4,
        "bookName": "Educated",
        "author": "Tara Westover",
        "coverImage": "https://m.media-amazon.com/images/I/81WojUxbbFL.jpg",
        "review": "A powerful memoir about a woman who escapes her strict upbringing to seek education. Tara Westover's 'Educated' chronicles her journey from growing up in a remote, survivalist family in Idaho to earning a PhD from Cambridge University. The memoir explores themes of self-discovery, resilience, and the transformative power of education. Westover's gripping narrative, filled with raw honesty and emotional depth, sheds light on the struggles and triumphs of overcoming one's past. Her story is both a personal and universal tale of the quest for knowledge and self-determination.",
        "pages": 334,
        "rating": 4.8,
        "category": "Memoir",
        "tag": "Inspiration",
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "id": 5,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "coverImage": "https://m.media-amazon.com/images/I/71aFt4+OTOL._AC_UF1000,1000_QL80_.jpg",
        "review": "A timeless tale of self-discovery and the pursuit of dreams. Paulo Coelho’s 'The Alchemist' follows Santiago, a shepherd boy who dreams of finding a hidden treasure. His journey takes him across the desert, where he learns profound lessons about destiny, personal legend, and the interconnectedness of all things. Coelho’s simple yet profound storytelling resonates with readers of all ages, encouraging them to follow their dreams and listen to their hearts. The novel’s philosophical underpinnings and allegorical nature make it a deeply inspiring and motivational read.",
        "pages": 208,
        "rating": 4.2,
        "category": "Fiction",
        "tag": "Adventure",
        "publisher": "HarperOne",
        "yearOfPublishing": 1988
    },
    {
        "id": 6,
        "bookName": "Sapiens: A Brief History of Humankind",
        "author": "Yuval Noah Harari",
        "coverImage": "https://m.media-amazon.com/images/I/713jIoMO3UL._AC_UF1000,1000_QL80_.jpg",
        "review": "An insightful exploration of human history, culture, and evolution. Yuval Noah Harari's 'Sapiens' delves into the sweeping narrative of human development from the Stone Age to the modern era. The book presents complex ideas in an accessible way, examining how Homo sapiens came to dominate the world and shape societies. Harari discusses the cognitive revolution, agricultural revolution, and the impact of scientific advances on human existence. His thought-provoking analysis challenges readers to reconsider their place in the world and the course of human history.",
        "pages": 443,
        "rating": 4.7,
        "category": "Non-Fiction",
        "tag": "History",
        "publisher": "Harper",
        "yearOfPublishing": 2014
    },
    {
        "id": 7,
        "bookName": "Dune",
        "author": "Frank Herbert",
        "coverImage": "https://m.media-amazon.com/images/I/41EGe-fPqcL._SY445_SX342_.jpg",
        "review": "A groundbreaking science fiction epic that explores politics, religion, and survival. Frank Herbert’s 'Dune' is set in a distant future where noble families vie for control of the desert planet Arrakis, the only source of the universe’s most valuable substance. The story follows Paul Atreides as he navigates treacherous political intrigue and prophecy. With its richly detailed world-building and complex characters, 'Dune' explores themes of power, ecology, and destiny. Its influence on the science fiction genre is profound, making it a seminal work in speculative fiction.",
        "pages": 412,
        "rating": 4.5,
        "category": "Science Fiction",
        "tag": "Epic",
        "publisher": "Chilton Books",
        "yearOfPublishing": 1965
    },
    {
        "id": 8,
        "bookName": "The Midnight Library",
        "author": "Matt Haig",
        "coverImage": "https://m.media-amazon.com/images/I/414GhW3ZqML._SY445_SX342_.jpg",
        "review": "A thought-provoking novel about regret, choices, and the infinite possibilities of life. Matt Haig’s 'The Midnight Library' follows Nora Seed, who finds herself in a magical library that allows her to explore alternate versions of her life. Each book represents a different path she might have taken. As she delves into these parallel lives, Nora contemplates her regrets and the true meaning of happiness. Haig’s narrative is both imaginative and deeply emotional, offering readers a unique perspective on life’s choices and the search for fulfillment.",
        "pages": 304,
        "rating": 4.4,
        "category": "Fiction",
        "tag": "Fantasy",
        "publisher": "Viking",
        "yearOfPublishing": 2020
    },
    {
        "id": 9,
        "bookName": "Atomic Habits",
        "author": "James Clear",
        "coverImage": "https://m.media-amazon.com/images/I/81YkqyaFVEL._SY466_.jpg",
        "review": "A practical guide to building good habits and breaking bad ones with actionable advice. James Clear’s 'Atomic Habits' provides a comprehensive framework for making small changes that lead to significant improvements. Clear emphasizes the power of tiny habits and the importance of identity-based change. Through engaging anecdotes and scientific research, he outlines strategies for habit formation and maintenance. The book is a valuable resource for anyone looking to optimize their behavior and achieve personal or professional goals. Clear’s insights are practical, motivational, and grounded in real-world application.",
        "pages": 320,
        "rating": 4.8,
        "category": "Self-Help",
        "tag": "Productivity",
        "publisher": "Avery",
        "yearOfPublishing": 2018
    }
]
